In [53]:
import pandas as pd

# CIPLA

In [54]:
CIPLA_df = pd.read_csv("D:\Study\Project\Stocks-Visualizing-and-Analysis\Datasets\CIPLA.NS .csv")
CIPLA_df["Name"]="CIPLA"
CIPLA_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,2018-04-02,548.000000,578.950012,545.900024,576.250000,562.826416,2823880,CIPLA
1,2018-04-03,572.000000,578.349976,568.799988,570.299988,557.014954,2493190,CIPLA
2,2018-04-04,572.349976,575.450012,564.500000,569.799988,556.526672,1852997,CIPLA
3,2018-04-05,574.000000,578.549988,558.349976,560.349976,547.296753,2396864,CIPLA
4,2018-04-06,560.299988,571.000000,557.250000,558.950012,545.929382,2420324,CIPLA

In [55]:
#as the data is too big. i am rounding of the data after decimals.
CIPLA_df = CIPLA_df.round(2)
CIPLA_df.head(2)

         Date   Open    High    Low   Close  Adj Close   Volume   Name
0  2018-04-02  548.0  578.95  545.9  576.25     562.83  2823880  CIPLA
1  2018-04-03  572.0  578.35  568.8  570.30     557.01  2493190  CIPLA

In [56]:
CIPLA_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

In [57]:
CIPLA_df.dropna(inplace = True, axis = 0)

In [58]:
#here is checked the size of data
CIPLA_df.shape

(989, 8)

In [59]:
#here checking if there is any null values in the dataset
CIPLA_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

in the output of null values we found that there is not null value in the dataset

In [60]:
#lets check the datatypes of each the column
CIPLA_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
Name          object
dtype: object

In [61]:
#here we can see that data is in object format. pandas has inbuilt functions for data but the data should be in type ‘datetime64(ns)’
CIPLA_df['Date'] = pd.to_datetime(CIPLA_df['Date'])
CIPLA_df.head(2)

        Date   Open    High    Low   Close  Adj Close   Volume   Name
0 2018-04-02  548.0  578.95  545.9  576.25     562.83  2823880  CIPLA
1 2018-04-03  572.0  578.35  568.8  570.30     557.01  2493190  CIPLA

In [62]:
CIPLA_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
Name                 object
dtype: object

here we can see that the datatype of the data column changed to datetime64[ns]

In [63]:
#here we can check total duration of analysis
CIPLA_df['Date'].max()-CIPLA_df['Date'].min()

Timedelta('1459 days 00:00:00')

In [64]:
#describe function in pandas is used to get the descriptive data from the data. and with that i have used to astype to change the data from the float to the int.
CIPLA_df.describe().astype(int)

       Open  High   Low  Close  Adj Close    Volume
count   989   989   989    989        989       989
mean    683   691   673    681        673   4107481
std     179   181   177    179        180   4229453
min     370   390   355    374        370     96347
25%     531   536   525    531        520   1708157
50%     639   646   631    637        627   2647759
75%     850   864   841    848        839   5072916
max    1077  1083  1049   1068       1062  56895213

In [65]:
#Downloading Cleaned Data
cleaned_cipla = CIPLA_df
cleaned_cipla.to_csv("Cleaned Cipla.csv")

# Hindustan Unilever

In [66]:
HINDUNILVR_df = pd.read_csv("D:\Study\Project\Stocks-Visualizing-and-Analysis\Datasets\HINDUNILVR.NS.csv")
HINDUNILVR_df["Name"]="HINDUNILVR"
HINDUNILVR_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,2018-04-02,1315.000000,1360.550049,1315.000000,1351.300049,1246.386230,708747,HINDUNILVR
1,2018-04-03,1347.099976,1355.500000,1338.650024,1348.400024,1243.711426,979726,HINDUNILVR
2,2018-04-04,1348.000000,1360.000000,1339.550049,1357.449951,1252.058594,912607,HINDUNILVR
3,2018-04-05,1380.000000,1383.800049,1362.699951,1382.199951,1274.887085,588716,HINDUNILVR
4,2018-04-06,1381.949951,1381.949951,1362.449951,1374.800049,1268.061768,633937,HINDUNILVR

In [67]:
#as the data is too big. i am rounding of the data after decimals.
HINDUNILVR_df = HINDUNILVR_df.round(2)
HINDUNILVR_df.head(2)

         Date    Open     High      Low   Close  Adj Close  Volume        Name
0  2018-04-02  1315.0  1360.55  1315.00  1351.3    1246.39  708747  HINDUNILVR
1  2018-04-03  1347.1  1355.50  1338.65  1348.4    1243.71  979726  HINDUNILVR

In [68]:
HINDUNILVR_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

In [69]:
HINDUNILVR_df.dropna(inplace = True, axis = 0)

In [70]:
#here is checked the size of data
HINDUNILVR_df.shape

(989, 8)

In [71]:
#here checking if there is any null values in the dataset
HINDUNILVR_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

in the output of null values we found that there is not null value in the dataset

In [72]:
#lets check the datatypes of each the column
HINDUNILVR_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
Name          object
dtype: object

In [73]:
#here we can see that data is in object format. pandas has inbuilt functions for data but the data should be in type ‘datetime64(ns)’
HINDUNILVR_df['Date'] = pd.to_datetime(HINDUNILVR_df['Date'])
HINDUNILVR_df.head(2)

        Date    Open     High      Low   Close  Adj Close  Volume        Name
0 2018-04-02  1315.0  1360.55  1315.00  1351.3    1246.39  708747  HINDUNILVR
1 2018-04-03  1347.1  1355.50  1338.65  1348.4    1243.71  979726  HINDUNILVR

In [74]:
HINDUNILVR_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
Name                 object
dtype: object

here we can see that the datatype of the data column changed to datetime64[ns]

In [75]:
#here we can check total duration of analysis
HINDUNILVR_df['Date'].max()-HINDUNILVR_df['Date'].min()

Timedelta('1459 days 00:00:00')

In [76]:
#describe function in pandas is used to get the descriptive data from the data. and with that i have used to astype to change the data from the float to the int.
HINDUNILVR_df.describe().astype(int)

       Open  High   Low  Close  Adj Close     Volume
count   989   989   989    989        989        989
mean   2050  2070  2027   2048       1950    2124460
std     317   319   312    315        328    6069969
min    1315  1355  1315   1348       1243      85187
25%    1766  1779  1746   1763       1648    1099574
50%    2090  2116  2062   2087       1989    1573884
75%    2310  2330  2281   2307       2232    2251405
max    2827  2859  2796   2812       2727  185669922

In [77]:
#Downloading Cleaned Data
cleaned_hul = HINDUNILVR_df
cleaned_hul.to_csv("Cleaned HUL.csv")

# Infosys

In [78]:
INFY_df = pd.read_csv("D:\Study\Project\Stocks-Visualizing-and-Analysis\Datasets\INFY.NS.csv")
INFY_df["Name"]="INFOSYS"
INFY_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,2018-04-02,570.500000,574.775024,560.650024,568.575012,501.081512,8072702,INFOSYS
1,2018-04-03,567.349976,571.775024,564.049988,570.224976,502.535675,4077168,INFOSYS
2,2018-04-04,572.000000,572.275024,560.000000,562.099976,495.375122,4813302,INFOSYS
3,2018-04-05,569.775024,575.650024,564.549988,573.775024,505.664398,7763544,INFOSYS
4,2018-04-06,571.500000,573.000000,561.049988,563.500000,496.608948,5937742,INFOSYS

In [79]:
#as the data is too big. i am rounding of the data aftdr decimals.
INFY_df = INFY_df.round(2)
INFY_df.head(2)

         Date    Open    High     Low   Close  Adj Close   Volume     Name
0  2018-04-02  570.50  574.78  560.65  568.58     501.08  8072702  INFOSYS
1  2018-04-03  567.35  571.78  564.05  570.22     502.54  4077168  INFOSYS

In [80]:
INFY_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

In [81]:
INFY_df.dropna(inplace = True, axis = 0)

In [82]:
#here is checked the size of data
INFY_df.shape

(989, 8)

In [83]:
#here checking if there is any null values in the dataset
INFY_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

in the output of null values we found that there is not null value in the dataset

In [84]:
#lets check the datatypes of each the column
INFY_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
Name          object
dtype: object

In [85]:
#here we can see that data is in object format. pandas has inbuilt functions for data but the data should be in type ‘datetime64(ns)’
INFY_df['Date'] = pd.to_datetime(INFY_df['Date'])
INFY_df.head(2)

        Date    Open    High     Low   Close  Adj Close   Volume     Name
0 2018-04-02  570.50  574.78  560.65  568.58     501.08  8072702  INFOSYS
1 2018-04-03  567.35  571.78  564.05  570.22     502.54  4077168  INFOSYS

In [86]:
INFY_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
Name                 object
dtype: object

here we can see that the datatype of the data column changed to datetime64[ns]

In [87]:
#here we can check total duration of analysis
INFY_df['Date'].max()-INFY_df['Date'].min()

Timedelta('1459 days 00:00:00')

In [88]:
#describe function in pandas is used to get the descriptive data from the data. and with that i have used to astype to change the data from the float to the int.
INFY_df.describe().astype(int)

       Open  High   Low  Close  Adj Close    Volume
count   989   989   989    989        989       989
mean   1021  1033  1011   1022        966   8681175
std     415   419   412    416        423   6296617
min     509   558   509    526        489    483407
25%     706   712   697    705        644   5447130
50%     781   789   773    781        723   7165335
75%    1347  1363  1336   1351       1296   9932198
max    1938  1953  1930   1939       1898  90432109

In [89]:
#Downloading Cleaned Data
cleaned_infy = INFY_df
cleaned_infy.to_csv("Cleaned Infosys.csv")

# Reliance

In [90]:
RELIANCE_df = pd.read_csv("D:\Study\Project\Stocks-Visualizing-and-Analysis\Datasets\RELIANCE.NS.csv")
RELIANCE_df["Name"]="RELIANCE"
RELIANCE_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,2018-04-02,884.614746,892.490112,878.175781,884.565186,865.632141,5766209,RELIANCE
1,2018-04-03,882.633545,893.233032,876.937500,891.103210,872.030273,6425059,RELIANCE
2,2018-04-04,896.204895,903.238220,883.673645,886.496887,867.522522,6560005,RELIANCE
3,2018-04-05,896.601135,901.455078,895.016113,899.671997,880.415649,3935631,RELIANCE
4,2018-04-06,899.473877,909.875305,896.502075,902.445740,883.130005,4460344,RELIANCE

In [91]:
#as the data is too big. i am rounding of the data aftdr decimals.
RELIANCE_df = RELIANCE_df.round(2)
RELIANCE_df.head(2)

         Date    Open    High     Low   Close  Adj Close   Volume      Name
0  2018-04-02  884.61  892.49  878.18  884.57     865.63  5766209  RELIANCE
1  2018-04-03  882.63  893.23  876.94  891.10     872.03  6425059  RELIANCE

In [92]:
RELIANCE_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

In [93]:
RELIANCE_df.dropna(inplace = True, axis = 0)

In [94]:
#here is checked the size of data
RELIANCE_df.shape

(989, 8)

In [95]:
#here checking if there is any null values in the dataset
RELIANCE_df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
Name         0
dtype: int64

in the output of null values we found that there is not null value in the dataset

In [96]:
#lets check the datatypes of each the column
RELIANCE_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
Name          object
dtype: object

In [97]:
#here we can see that data is in object format. pandas has inbuilt functions for data but the data should be in type ‘datetime64(ns)’
RELIANCE_df['Date'] = pd.to_datetime(RELIANCE_df['Date'])
RELIANCE_df.head(2)

        Date    Open    High     Low   Close  Adj Close   Volume      Name
0 2018-04-02  884.61  892.49  878.18  884.57     865.63  5766209  RELIANCE
1 2018-04-03  882.63  893.23  876.94  891.10     872.03  6425059  RELIANCE

In [98]:
RELIANCE_df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
Name                 object
dtype: object

here we can see that the datatype of the data column changed to datetime64[ns]

In [99]:
#here we can check total duration of analysis
RELIANCE_df['Date'].max()-RELIANCE_df['Date'].min()

Timedelta('1459 days 00:00:00')

In [100]:
#describe function in pandas is used to get the descriptive data from the data. and with that i have used to astype to change the data from the float to the int.
RELIANCE_df.describe().astype(int)

       Open  High   Low  Close  Adj Close    Volume
count   989   989   989    989        989       989
mean   1667  1686  1645   1665       1651  10802851
std     511   516   506    510        514   7827387
min     882   892   867    875        865    787160
25%    1224  1240  1210   1223       1207   6068321
50%    1526  1535  1507   1520       1505   8558745
75%    2111  2130  2084   2106       2095  12755947
max    2742  2751  2708   2731       2723  65848350

In [101]:
#Downloading Cleaned Data
cleaned_ril = RELIANCE_df
cleaned_ril.to_csv("Cleaned Reliance.csv")

COMBINED ANALYSIS FILE

In [102]:
#Combining all the csvs
#creating the combined frame called "frames" consisting all the frames
frames=[INFY_df,HINDUNILVR_df,RELIANCE_df,CIPLA_df]
#concatinating the combined 
data_all=pd.concat(frames)
#creating the combined csv of all the data frames
data_all.to_csv('CombinedALL.csv')

In [103]:
data_all

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,2018-04-02,570.50,574.78,560.65,568.58,501.08,8072702,INFOSYS
1,2018-04-03,567.35,571.78,564.05,570.22,502.54,4077168,INFOSYS
2,2018-04-04,572.00,572.28,560.00,562.10,495.38,4813302,INFOSYS
3,2018-04-05,569.78,575.65,564.55,573.78,505.66,7763544,INFOSYS
4,2018-04-06,571.50,573.00,561.05,563.50,496.61,5937742,INFOSYS
...,...,...,...,...,...,...,...,...
984,2022-03-25,1033.30,1033.30,1006.00,1013.50,1008.60,1680031,CIPLA
985,2022-03-28,1022.00,1044.25,1008.90,1017.10,1012.18,3847112,CIPLA
986,2022-03-29,1020.20,1041.00,1020.20,1038.85,1033.83,3194089,CIPLA
987,2022-03-30,1043.00,1054.80,1025.20,1028.95,1023.98,3083750,CIPLA
988,2022-03-31,1030.00,1035.00,1013.60,1018.05,1013.13,1976418,CIPLA